In [5]:
import pandas as pd
import numpy as np

In [25]:
### BASICS
### SERIES AND DATAFRAMES

In [3]:
num_list = [1,2,3,4,5]

pd.Series(num_list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
week_days = ['Mon', 'Tues', 'Wed', 'Thur', 'Fri']

pd.Series(week_days, index=['a','b','c','d','e'])

a     Mon
b    Tues
c     Wed
d    Thur
e     Fri
dtype: object

In [5]:
countries_code = { 1:"United States",
                 91:"India",
                 49:"Germany",
                 86:"China",
                250:"Rwanda"}

pd.Series(countries_code)

1      United States
91             India
49           Germany
86             China
250           Rwanda
dtype: object

In [6]:
d = {1:'a', 2:'b', 3:'c', 4:'d'}
pd.Series(d)

1    a
2    b
3    c
4    d
dtype: object

In [7]:
arr = np.array([1,2,3,4,5])

pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
pd.Series(arr, index=list('abcde'))

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
countries = {'Name': ['USA', 'India', 'Germany', 'Rwanda'],
             'Codes': [1, 91, 49, 250]}

pd.DataFrame(countries)

      Name  Codes
0      USA      1
1    India     91
2  Germany     49
3   Rwanda    250

In [12]:
array_2d = np.array([[1,2,3], [4,5,6], [7,8,9]])

pd.DataFrame(array_2d, columns = ['column 1', 'column 2', 'column 3',])

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [13]:
countries_code = { "United States": 1,
                 "India": 91,
                 "Germany": 49,
                 "China": 86,
                 "Rwanda":250}

pd_series = pd.Series(countries_code)
pd_series

United States      1
India             91
Germany           49
China             86
Rwanda           250
dtype: int64

In [15]:
df = pd.DataFrame(pd_series, columns = ['Codes'])
df

               Codes
United States      1
India             91
Germany           49
China             86
Rwanda           250

In [17]:
df['Population'] = [100, 450, 57, 5885, 533]
df

               Codes  Population
United States      1         100
India             91         450
Germany           49          57
China             86        5885
Rwanda           250         533

In [18]:
df.drop('Population', axis=1)

               Codes
United States      1
India             91
Germany           49
China             86
Rwanda           250

In [21]:
df.columns

Index(['Codes', 'Population'], dtype='object')

In [22]:
df.keys

<bound method NDFrame.keys of                Codes  Population
United States      1         100
India             91         450
Germany           49          57
China             86        5885
Rwanda           250         533>

In [23]:
df.index

Index(['United States', 'India', 'Germany', 'China', 'Rwanda'], dtype='object')

In [26]:
### DATA INDEXING, SELECTION AND ITERATION

In [27]:
countries = {'Name': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

df = pd.DataFrame(countries, index=list('abcd'))
df

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [28]:
df['Name']

a       USA
b     India
c    German
d    Rwanda
Name: Name, dtype: object

In [29]:
df.Name

a       USA
b     India
c    German
d    Rwanda
Name: Name, dtype: object

In [30]:
df['Codes']

a      1
b     91
c     49
d    250
Name: Codes, dtype: int64

In [31]:
df[ ['Name', 'Codes'] ]

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [32]:
df [0:2]

    Name  Codes
a    USA      1
b  India     91

In [33]:
df [0:-1]

     Name  Codes
a     USA      1
b   India     91
c  German     49

In [34]:
df[-1:0]

Empty DataFrame
Columns: [Name, Codes]
Index: []

In [35]:
df [-2:0]

Empty DataFrame
Columns: [Name, Codes]
Index: []

In [36]:
df[-2:]

     Name  Codes
c  German     49
d  Rwanda    250

In [37]:
df[1:]

     Name  Codes
b   India     91
c  German     49
d  Rwanda    250

In [38]:
df.loc['a']

Name     USA
Codes      1
Name: a, dtype: object

In [39]:
df

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [40]:
df.loc['b':'d']

     Name  Codes
b   India     91
c  German     49
d  Rwanda    250

In [41]:
df[:'b']

    Name  Codes
a    USA      1
b  India     91

In [42]:
df.iloc[2]

Name     German
Codes        49
Name: c, dtype: object

In [43]:
df.iloc[1:3]

     Name  Codes
b   India     91
c  German     49

In [44]:
df.iloc[2:]

     Name  Codes
c  German     49
d  Rwanda    250

In [45]:
df

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [47]:
df[df['Codes'] == 49]

     Name  Codes
c  German     49

In [48]:
df [df['Codes'] < 250]

     Name  Codes
a     USA      1
b   India     91
c  German     49

In [49]:
df [df['Name'] == 'USA']

  Name  Codes
a  USA      1

In [50]:
sample_codes_names = [1,3,250,'USA', 'India', 'England']

df.isin(sample_codes_names)

    Name  Codes
a   True   True
b   True  False
c  False  False
d  False   True

In [51]:
sample_codes_names = {'Codes':[1,3,250], 'Name':['USA', 'India', 'England']}

df.isin(sample_codes_names)

    Name  Codes
a   True   True
b   True  False
c  False  False
d  False   True

In [53]:
df2 = pd.DataFrame(np.array([[1,2,3], [4,5,6], [7,8,9]]),
                  columns = ['column 1', 'column 2', 'column 3',])

df2

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [54]:
df2.isin([0,3,4,5,7])

   column 1  column 2  column 3
0     False     False      True
1      True      True     False
2      True     False     False

In [56]:
df2 [df2 > 4]

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       5.0       6.0
2       7.0       8.0       9.0

In [58]:
df2.where(df2 > 4)

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       5.0       6.0
2       7.0       8.0       9.0

In [59]:
df2.where(df2 > 4, 0)

   column 1  column 2  column 3
0         0         0         0
1         0         5         6
2         7         8         9

In [60]:
df2

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [61]:
df2 [df2 <= 4] = 0

In [62]:
df2

   column 1  column 2  column 3
0         0         0         0
1         0         5         6
2         7         8         9

In [70]:
df2 [df2 <= 4] = 0
df2

   column 1  column 2  column 3
0         0         0         0
1         0         5         6
2         7         8         9

In [71]:
for col_name, content in df2.items():
    print(col_name)
    print(content)

column 1
0    0
1    0
2    7
Name: column 1, dtype: int64
column 2
0    0
1    5
2    8
Name: column 2, dtype: int64
column 3
0    0
1    6
2    9
Name: column 3, dtype: int64

In [72]:
for row in df2.iterrows():
    print(row)

(0, column 1    0
column 2    0
column 3    0
Name: 0, dtype: int64)
(1, column 1    0
column 2    5
column 3    6
Name: 1, dtype: int64)
(2, column 1    7
column 2    8
column 3    9
Name: 2, dtype: int64)

In [73]:
for row in df2.itertuples():
    print(row)

Pandas(Index=0, _1=0, _2=0, _3=0)
Pandas(Index=1, _1=0, _2=5, _3=6)
Pandas(Index=2, _1=7, _2=8, _3=9)

In [74]:
### DEALING WITH MISSING DATA

In [75]:
df3 = pd.DataFrame(np.array([[1,2,3],[4,np.nan,6],[7,np.nan,np.nan]]),
                  columns = ['column 1', 'column 2', 'column 3'])

In [77]:
df3.isnull()

   column 1  column 2  column 3
0     False     False     False
1     False      True     False
2     False      True      True

In [78]:
df3.isnull().sum()

column 1    0
column 2    2
column 3    1
dtype: int64

In [79]:
df3.notna()

   column 1  column 2  column 3
0      True      True      True
1      True     False      True
2      True     False     False

In [80]:
df3.notna().sum()

column 1    3
column 2    1
column 3    2
dtype: int64

In [81]:
df3.dropna()

   column 1  column 2  column 3
0       1.0       2.0       3.0

In [82]:
df3

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       NaN       6.0
2       7.0       NaN       NaN

In [83]:
df3['column 3'].dropna()

0    3.0
1    6.0
Name: column 3, dtype: float64

In [84]:
df3.dropna(axis=1)

   column 1
0       1.0
1       4.0
2       7.0

In [85]:
df3.fillna(10)

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0      10.0       6.0
2       7.0      10.0      10.0

In [86]:
df3.fillna('fill me')

   column 1 column 2 column 3
0       1.0      2.0      3.0
1       4.0  fill me      6.0
2       7.0  fill me  fill me

In [87]:
df3.fillna(method='ffill')

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       2.0       6.0
2       7.0       2.0       6.0

In [88]:
df3.fillna(method='bfill')

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       NaN       6.0
2       7.0       NaN       NaN

In [89]:
df3.fillna(method='bfill', axis='columns')

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       6.0       6.0
2       7.0       NaN       NaN

In [90]:
### MORE OPERATIONS AND FUNCTIONS

In [91]:
df4 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag'], 
              'Order Number':[45,56,64], 
              'Total Quantity':[10,5,9]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])

In [92]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9

In [93]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product Name    3 non-null      object
 1   Order Number    3 non-null      int64
 2   Total Quantity  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [94]:
df4.columns

Index(['Product Name', 'Order Number', 'Total Quantity'], dtype='object')

In [95]:
df4.keys

<bound method NDFrame.keys of   Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9>

In [96]:
df4.head(1)

  Product Name  Order Number  Total Quantity
0        Shirt            45              10

In [97]:
df4.tail(1)

  Product Name  Order Number  Total Quantity
2          Bag            64               9

In [98]:
df4.values

array([['Shirt', 45, 10],
       ['Boot', 56, 5],
       ['Bag', 64, 9]], dtype=object)

In [99]:
df4.size

9

In [100]:
df4.shape

(3, 3)

In [101]:
df4.shape[0]

3

In [102]:
df4.shape[1]

3

In [103]:
df4['Product Name'].unique()

array(['Shirt', 'Boot', 'Bag'], dtype=object)

In [104]:
df4['Product Name'].unique().sum()

'ShirtBootBag'

In [105]:
df4['Product Name'].nunique()

3

In [107]:
df4.head(0)

Empty DataFrame
Columns: [Product Name, Order Number, Total Quantity]
Index: []

In [114]:
df4.iloc[:,0].nunique()

3

In [115]:
df4['Product Name'].value_counts()

Shirt    1
Boot     1
Bag      1
Name: Product Name, dtype: int64

In [116]:
def double(x):
    return 2*x

In [117]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9

In [118]:
df4['Total Quantity'].apply(double)

0    20
1    10
2    18
Name: Total Quantity, dtype: int64

In [120]:
df5 = pd.DataFrame([[1,2], [4,5]], columns=['col1', 'col2'])
df5

   col1  col2
0     1     2
1     4     5

In [121]:
df5.applymap(lambda x: 2*x)

   col1  col2
0     2     4
1     8    10

In [122]:
df4.sort_values(['Order Number'])

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9

In [123]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9

In [125]:
df4.sort_values(['Order Number'], ascending=False)

  Product Name  Order Number  Total Quantity
2          Bag            64               9
1         Boot            56               5
0        Shirt            45              10

In [126]:
### AGGREGATION METHODS

In [127]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9

In [128]:
df4.describe()

       Order Number  Total Quantity
count      3.000000        3.000000
mean      55.000000        8.000000
std        9.539392        2.645751
min       45.000000        5.000000
25%       50.500000        7.000000
50%       56.000000        9.000000
75%       60.000000        9.500000
max       64.000000       10.000000

In [130]:
df4.describe().T == df4.describe().transpose()

                count  mean   std   min   25%   50%   75%   max
Order Number     True  True  True  True  True  True  True  True
Total Quantity   True  True  True  True  True  True  True  True

In [132]:
df4.describe().T

                count  mean       std   min   25%   50%   75%   max
Order Number      3.0  55.0  9.539392  45.0  50.5  56.0  60.0  64.0
Total Quantity    3.0   8.0  2.645751   5.0   7.0   9.0   9.5  10.0

In [133]:
df4['Total Quantity'].mode()

0     5
1     9
2    10
Name: Total Quantity, dtype: int64

In [134]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9

In [135]:
df4['Total Quantity'].max()

10

In [137]:
df4['Total Quantity'].min()

5

In [138]:
df4['Total Quantity'].mean()

8.0

In [139]:
df4['Total Quantity'].median()

9.0

In [140]:
df4['Total Quantity'].std()

2.6457513110645907

In [141]:
df4['Total Quantity'].var()

7.0

In [142]:
df4['Total Quantity'].sum()

24

In [143]:
df4['Total Quantity'].prod()

450

In [144]:
### GROUPBY

In [6]:
df4 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag', 'Ankle', 'Pullover', 'Boot', 'Ankle', 'Tshirt', 'Shirt'], 
              'Order Number':[45,56,64, 34, 67, 56, 34, 89, 45], 
              'Total Quantity':[10,5,9, 11, 11, 8, 14, 23, 10]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])

df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3        Ankle            34              11
4     Pullover            67              11
5         Boot            56               8
6        Ankle            34              14
7       Tshirt            89              23
8        Shirt            45              10

In [7]:
df4.groupby('Product Name').mean()

              Order Number  Total Quantity
Product Name
Ankle                 34.0            12.5
Bag                   64.0             9.0
Boot                  56.0             6.5
Pullover              67.0            11.0
Shirt                 45.0            10.0
Tshirt                89.0            23.0

In [8]:
df4.groupby('Product Name').sum()

              Order Number  Total Quantity
Product Name
Ankle                   68              25
Bag                     64               9
Boot                   112              13
Pullover                67              11
Shirt                   90              20
Tshirt                  89              23

In [9]:
df4.groupby('Product Name').min()

              Order Number  Total Quantity
Product Name
Ankle                   34              11
Bag                     64               9
Boot                    56               5
Pullover                67              11
Shirt                   45              10
Tshirt                  89              23

In [10]:
df4.groupby(['Product Name', 'Order Number']).max()

                           Total Quantity
Product Name Order Number
Ankle        34                        14
Bag          64                         9
Boot         56                         8
Pullover     67                        11
Shirt        45                        10
Tshirt       89                        23

In [11]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3        Ankle            34              11
4     Pullover            67              11
5         Boot            56               8
6        Ankle            34              14
7       Tshirt            89              23
8        Shirt            45              10

In [12]:
df4.groupby('Product Name').aggregate(['min', 'max', 'sum'])

             Order Number          Total Quantity
                      min max  sum            min max sum
Product Name
Ankle                  34  34   68             11  14  25
Bag                    64  64   64              9   9   9
Boot                   56  56  112              5   8  13
Pullover               67  67   67             11  11  11
Shirt                  45  45   90             10  10  20
Tshirt                 89  89   89             23  23  23

In [13]:
### COMBINING DATASETS: CONCATENATING, JOINING AND MERGING

In [14]:
# Creating dataframes

df1 = pd.DataFrame({'Col1':['A','B','C'],
                   'Col2':[1,2,3]}, 
                   index=['a','b','c'])

df2 = pd.DataFrame({'Col1':['D','E','F'],
                   'Col2':[4,5,6]}, 
                   index=['d','e','f'])


df3 = pd.DataFrame({'Col1':['G','I','J'],
                   'Col2':[7,8,9]}, 
                   index=['g', 'i','j'])

In [15]:
df1

  Col1  Col2
a    A     1
b    B     2
c    C     3

In [16]:
df2

  Col1  Col2
d    D     4
e    E     5
f    F     6

In [17]:
df3

  Col1  Col2
g    G     7
i    I     8
j    J     9

In [18]:
pd.concat([df1, df2, df3])

  Col1  Col2
a    A     1
b    B     2
c    C     3
d    D     4
e    E     5
f    F     6
g    G     7
i    I     8
j    J     9

In [19]:
pd.concat([df1, df2, df3], axis=1)

  Col1  Col2 Col1  Col2 Col1  Col2
a    A   1.0  NaN   NaN  NaN   NaN
b    B   2.0  NaN   NaN  NaN   NaN
c    C   3.0  NaN   NaN  NaN   NaN
d  NaN   NaN    D   4.0  NaN   NaN
e  NaN   NaN    E   5.0  NaN   NaN
f  NaN   NaN    F   6.0  NaN   NaN
g  NaN   NaN  NaN   NaN    G   7.0
i  NaN   NaN  NaN   NaN    I   8.0
j  NaN   NaN  NaN   NaN    J   9.0

In [20]:
df1.append([df2, df3])

/tmp/ipykernel_4364/266511466.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append([df2, df3])

  Col1  Col2
a    A     1
b    B     2
c    C     3
d    D     4
e    E     5
f    F     6
g    G     7
i    I     8
j    J     9

In [21]:
df1 = pd.DataFrame({'Name': ['Joe', 'Joshua', 'Jeanne', 'David'],
                        'Role': ['Manager', 'Developer', 'Engineer', 'Scientist']})

df2 = pd.DataFrame({'Name': ['David', 'Joshua', 'Joe', 'Jeanne'],
'Year Hired': [2018, 2017, 2020, 2018]})

df3 = pd.DataFrame({'Name': ['David', 'Joshua', 'Joe', 'Jeanne'],
'No of Leaves': [15, 3, 10, 12]})

In [22]:
df1

     Name       Role
0     Joe    Manager
1  Joshua  Developer
2  Jeanne   Engineer
3   David  Scientist

In [23]:
df2

     Name  Year Hired
0   David        2018
1  Joshua        2017
2     Joe        2020
3  Jeanne        2018

In [24]:
pd.merge(df1, df2)

     Name       Role  Year Hired
0     Joe    Manager        2020
1  Joshua  Developer        2017
2  Jeanne   Engineer        2018
3   David  Scientist        2018

In [25]:
pd.merge(df1, df2, how='left', on='Name')

     Name       Role  Year Hired
0     Joe    Manager        2020
1  Joshua  Developer        2017
2  Jeanne   Engineer        2018
3   David  Scientist        2018

In [26]:
pd.merge(df1, df2, how='right', on='Name')

     Name       Role  Year Hired
0   David  Scientist        2018
1  Joshua  Developer        2017
2     Joe    Manager        2020
3  Jeanne   Engineer        2018

In [27]:
df1 = pd.DataFrame({'col1': ['K0', 'K0', 'K1', 'K2'],
                     'col2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
df2 = pd.DataFrame({'col1': ['K0', 'K1', 'K1', 'K2'],
                               'col2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [28]:
df1

  col1 col2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [29]:
df2

  col1 col2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [30]:
pd.merge(df1, df2, how='inner', on=['col1', 'col2'])

  col1 col2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [31]:
pd.merge(df1, df2, how='outer', on=['col1', 'col2'])

  col1 col2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [32]:
pd.merge(df1, df2, how='left')

  col1 col2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [33]:
pd.merge(df1, df2, how='right')

  col1 col2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [34]:
df1 = pd.DataFrame({'Col1': ['A', 'B', 'C'],
                     'Col2': [11, 12, 13]},
                      index=['a', 'b', 'c']) 

df2 = pd.DataFrame({'Col3': ['D', 'E', 'F'],
                    'Col4': [14, 14, 16]},
                      index=['a', 'c', 'd'])

In [35]:
df1

  Col1  Col2
a    A    11
b    B    12
c    C    13

In [36]:
df2

  Col3  Col4
a    D    14
c    E    14
d    F    16

In [37]:
df1.join(df2)

  Col1  Col2 Col3  Col4
a    A    11    D  14.0
b    B    12  NaN   NaN
c    C    13    E  14.0

In [38]:
df2.join(df1)

  Col3  Col4 Col1  Col2
a    D    14    A  11.0
c    E    14    C  13.0
d    F    16  NaN   NaN

In [39]:
df1.join(df2, how='inner')

  Col1  Col2 Col3  Col4
a    A    11    D    14
c    C    13    E    14

In [40]:
df1.join(df2, how='outer')

  Col1  Col2 Col3  Col4
a    A  11.0    D  14.0
b    B  12.0  NaN   NaN
c    C  13.0    E  14.0
d  NaN   NaN    F  16.0

In [41]:
### BEYOND DATAFRAMES: WORKING WITH CSV AND EXCEL

In [42]:
!curl -O https://raw.githubusercontent.com/nyandwi/public_datasets/master/housing.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 1390k  100 1390k    0     0  3030k      0 --:--:-- --:--:-- --:--:-- 3035k

In [43]:
data = pd.read_csv('housing.csv')

In [44]:
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [45]:
type(data)

pandas.core.frame.DataFrame

In [46]:
data.to_csv('housing_dataset', index=False)

In [47]:
data

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [48]:
type(data)

pandas.core.frame.DataFrame

In [49]:
data.to_excel('housing_excel.xlsx', index=False)

In [50]:
excel_data = pd.read_excel('housing_excel.xlsx')

In [51]:
excel_data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41,880,129.0,322,126,8.3252,452600,NEAR BAY
1,-122.22,37.86,21,7099,1106.0,2401,1138,8.3014,358500,NEAR BAY
2,-122.24,37.85,52,1467,190.0,496,177,7.2574,352100,NEAR BAY
3,-122.25,37.85,52,1274,235.0,558,219,5.6431,341300,NEAR BAY
4,-122.25,37.85,52,1627,280.0,565,259,3.8462,342200,NEAR BAY

In [52]:
### REAL WORLD

In [53]:
!curl -O https://raw.githubusercontent.com/nyandwi/public_datasets/master/winequality-red.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   98k  100   98k    0     0   290k      0 --:--:-- --:--:-- --:--:--  290k

In [54]:
wine_data = pd.read_csv('winequality-red.csv')

In [55]:
wine_data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [56]:
wine_data.tail()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6

In [57]:
wine_data.describe().T

,count,mean,std,min,25%,50%,75%,max
fixed acidity,1599.0,8.319637,1.741096,4.60000,7.1000,7.90000,9.200000,15.90000
volatile acidity,1599.0,0.527821,0.179060,0.12000,0.3900,0.52000,0.640000,1.58000
citric acid,1599.0,0.270976,0.194801,0.00000,0.0900,0.26000,0.420000,1.00000
residual sugar,1599.0,2.538806,1.409928,0.90000,1.9000,2.20000,2.600000,15.50000
chlorides,1599.0,0.087467,0.047065,0.01200,0.0700,0.07900,0.090000,0.61100
free sulfur dioxide,1599.0,15.874922,10.460157,1.00000,7.0000,14.00000,21.000000,72.00000
total sulfur dioxide,1599.0,46.467792,32.895324,6.00000,22.0000,38.00000,62.000000,289.00000
density,1599.0,0.996747,0.001887,0.99007,0.9956,0.99675,0.997835,1.00369
pH,1599.0,3.311113,0.154386,2.74000,3.2100,3.31000,3.400000,4.01000
sulphates,1599.0,0.658149,0.169507,0.33000,0.5500,0.62000,0.730000,2.00000
alcohol,1599.0,10.422983,1.065668,8.40000,9.5000,10.20000,11.100000,14.90000
quality,1599.0,5.636023,0.807569,3.00000,5.0000,6.00000,6.000000,8.00000

In [58]:
wine_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1599 entries, 0 to 1598
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   fixed acidity         1599 non-null   float64
 1   volatile acidity      1599 non-null   float64
 2   citric acid           1599 non-null   float64
 3   residual sugar        1599 non-null   float64
 4   chlorides             1599 non-null   float64
 5   free sulfur dioxide   1599 non-null   float64
 6   total sulfur dioxide  1599 non-null   float64
 7   density               1599 non-null   float64
 8   pH                    1599 non-null   float64
 9   sulphates             1599 non-null   float64
 10  alcohol               1599 non-null   float64
 11  quality               1599 non-null   int64
dtypes: float64(11), int64(1)
memory usage: 150.0 KB

In [59]:
wine_data.isnull().sum()

fixed acidity           0
volatile acidity        0
citric acid             0
residual sugar          0
chlorides               0
free sulfur dioxide     0
total sulfur dioxide    0
density                 0
pH                      0
sulphates               0
alcohol                 0
quality                 0
dtype: int64

In [60]:
wine_data['quality'].value_counts()

5    681
6    638
7    199
4     53
8     18
3     10
Name: quality, dtype: int64

In [61]:
wine_data.groupby(['fixed acidity', 'volatile acidity', 'citric acid']).sum()

                                            residual sugar  chlorides  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                    2.1      0.054
4.7           0.600            0.17                    2.3      0.058
4.9           0.420            0.00                    2.1      0.048
5.0           0.380            0.01                    1.6      0.048
              0.400            0.50                    4.3      0.046
...                                                    ...        ...
15.0          0.210            0.44                    4.4      0.150
15.5          0.645            0.49                    8.4      0.190
15.6          0.645            0.49                    4.2      0.095
              0.685            0.76                    3.7      0.100
15.9          0.360            0.65                    7.5      0.096

                                            free sulfur dioxide  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                         8.0
4.7           0.600            0.17                        17.0
4.9           0.420            0.00                        16.0
5.0           0.380            0.01                        26.0
              0.400            0.50                        29.0
...                                                         ...
15.0          0.210            0.44                        20.0
15.5          0.645            0.49                        20.0
15.6          0.645            0.49                        10.0
              0.685            0.76                         6.0
15.9          0.360            0.65                        22.0

                                            total sulfur dioxide  density  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                         65.0  0.99340
4.7           0.600            0.17                        106.0  0.99320
4.9           0.420            0.00                         42.0  0.99154
5.0           0.380            0.01                         60.0  0.99084
              0.400            0.50                         80.0  0.99020
...                                                          ...      ...
15.0          0.210            0.44                         48.0  2.00010
15.5          0.645            0.49                         46.0  2.00630
15.6          0.645            0.49                         23.0  1.00315
              0.685            0.76                         43.0  1.00320
15.9          0.360            0.65                         71.0  0.99760

                                              pH  sulphates  alcohol  quality
fixed acidity volatile acidity citric acid
4.6           0.520            0.15         3.90       0.56     13.1        4
4.7           0.600            0.17         3.85       0.60     12.9        6
4.9           0.420            0.00         3.71       0.74     14.0        7
5.0           0.380            0.01         3.70       0.75     14.0        6
              0.400            0.50         3.49       0.66     13.6        6
...                                          ...        ...      ...      ...
15.0          0.210            0.44         6.14       1.68     18.4       14
15.5          0.645            0.49         5.84       1.48     22.2       10
15.6          0.645            0.49         2.92       0.74     11.1        5
              0.685            0.76         2.95       0.68     11.2        7
15.9          0.360            0.65         2.98       0.84     14.9        5

[1333 rows x 9 columns]

In [63]:
print('DONE!')

DONE!